clojure-notes.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2019-03-01 五 19:13 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Clojure Notes Clojure Notes</title>
<meta name="generator" content="Org mode">
<meta name="author" content="George Kontsevich">
<meta name="description" content="Notes from studying Clojure"
>
<link rel="stylesheet" type="text/css" href="./static/worg.css" />
<link rel="stylesheet" type="text/css" href="https://geokon-gh.github.io/static/worg.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./index.html"> UP </a>
 |
 <a accesskey="H" href="./index.html"> HOME </a>
