clojure-notes.html

<div id="outline-container-org5a00571" class="outline-2">
<h2 id="org5a00571">Functions</h2>
<div class="outline-text-2" id="text-org5a00571">
</div>
<div id="outline-container-org13ed1f5" class="outline-3">
<h3 id="org13ed1f5">overloading</h3>
<div class="outline-text-3" id="text-org13ed1f5">
<p>
<i>done on argument</i>
</p>
<div class="org-src-container">
<pre class="src src-clojure">(<span style="color: #00af00;">defn</span> <span style="color: #ef2929;">x-chop</span>
  <span style="color: #cc0000;">"Describe the kind of chope you inflict"</span>
  ([name chop-type<span style="color: #999999;">]</span>
   (str <span style="color: #ff1f8b;">"I "</span> chop-type <span style="color: #ff1f8b;">" chop"</span> name <span style="color: #ff1f8b;">"! Take that!"</span><span style="color: #999999;">))</span>
  ([name<span style="color: #999999;">]</span>
   (x-chop name <span style="color: #ff1f8b;">"karate"</span><span style="color: #999999;">)))</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org70e3cd7" class="outline-3">
<h3 id="org70e3cd7">variable arity</h3>
<div class="outline-text-3" id="text-org70e3cd7">
<p>
<code>[&amp; remainding-items]</code> 
<i>and they are treated as a collection that you can use <code>map</code> on</i>
</p>
<div class="org-src-container">
<pre class="src src-clojure">(<span style="color: #00af00;">defn</span> <span style="color: #ef2929;">codger-communication</span>
  [whippersnapper<span style="color: #999999;">]</span>
  (str <span style="color: #ff1f8b;">"Get off my lawn, "</span> whippersnapper <span style="color: #ff1f8b;">"!!!"</span><span style="color: #999999;">))</span>

(<span style="color: #00af00;">defn</span> <span style="color: #ef2929;">codger</span>
  [&amp; whippersnappers<span style="color: #999999;">]</span>
  (map codger-communication whippersnappers<span style="color: #999999;">))</span>
(codger <span style="color: #ff1f8b;">"Billy"</span> <span style="color: #ff1f8b;">"Ann-Marie"</span> <span style="color: #ff1f8b;">"The Incredible Bulk"</span><span style="color: #999999;">)</span>
<span style="color: #b2b2b2; font-style: italic;">;; </span><span style="color: #b2b2b2; font-style: italic;">=&gt; ("Get off my lawn, Billy!!!"</span>
<span style="color: #b2b2b2; font-style: italic;">;;     </span><span style="color: #b2b2b2; font-style: italic;">"Get off my lawn,  Anne-Marie!!!"</span>
<span style="color: #b2b2b2; font-style: italic;">;;     </span><span style="color: #b2b2b2; font-style: italic;">"Get off my lawn,  The Incredible Bulk")</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org0f6b9c4" class="outline-3">
<h3 id="org0f6b9c4">private functions</h3>
<div class="outline-text-3" id="text-org0f6b9c4">
<p>
<i>exclusive to a namespace</i>
<code>(defn- privatefn)</code>
</p>
<div class="org-src-container">
<pre class="src src-clojure">(<span style="color: #00af00;">defn-</span> <span style="color: #ef2929;">private-function</span>
  <span style="color: #cc0000;">"Just an empty example"</span>
  [<span style="color: #999999;">])</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf21f14c" class="outline-3">
<h3 id="orgf21f14c">destructuring</h3>
<div class="outline-text-3" id="text-orgf21f14c">
<p>
<i>extracts things right in the argument declaration</i>
</p>
</div>
<div id="outline-container-orgd68586a" class="outline-4">
<h4 id="orgd68586a">first element</h4>
<div class="outline-text-4" id="text-orgd68586a">
<div class="org-src-container">
<pre class="src src-clojure">(<span style="color: #00af00;">defn</span> <span style="color: #ef2929;">my-first</span>
  [[first-thing<span style="color: #999999;">]]</span>
  first-thing<span style="color: #999999;">)</span>

(my-first [<span style="color: #ff1f8b;">"over"</span> <span style="color: #ff1f8b;">"bike"</span> <span style="color: #ff1f8b;">"war-axe"</span><span style="color: #999999;">])</span>
<span style="color: #b2b2b2; font-style: italic;">;; </span><span style="color: #b2b2b2; font-style: italic;">=&gt; oven</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org1092bc6" class="outline-4">
<h4 id="org1092bc6">vectors and variable arity</h4>
<div class="outline-text-4" id="text-org1092bc6">
<p>
<i>sequencially match vector elements to indices in order. remainer placed with an ampersand</i>
</p>
<div class="org-src-container">
<pre class="src src-clojure">  (<span style="color: #00af00;">defn</span> <span style="color: #ef2929;">chooser</span>
  [[first second &amp;other-stuff<span style="color: #999999;">]]</span>
    (println (str <span style="color: #ff1f8b;">"first thing was :"</span> first<span style="color: #999999;">))</span>
    (println (str <span style="color: #ff1f8b;">"second was :"</span> second<span style="color: #999999;">))</span>
    (println (str <span style="color: #ff1f8b;">"and the rest was  :"</span> 
                  (<span style="color: #18b2b2;">clojure.string</span>/join <span style="color: #ff1f8b;">", "</span> other-stuff<span style="color: #999999;">))))</span>

(chooser [<span style="color: #ff1f8b;">"icecream"</span>, <span style="color: #ff1f8b;">"cake"</span>, <span style="color: #ff1f8b;">"apples"</span>, <span style="color: #ff1f8b;">"lettuce"</span><span style="color: #999999;">])</span>
<span style="color: #b2b2b2; font-style: italic;">;; </span><span style="color: #b2b2b2; font-style: italic;">=&gt; first thing was: icecream</span>
<span style="color: #b2b2b2; font-style: italic;">;; </span><span style="color: #b2b2b2; font-style: italic;">=&gt; second was: cake</span>
<span style="color: #b2b2b2; font-style: italic;">;; </span><span style="color: #b2b2b2; font-style: italic;">=&gt; and the rest was : apples, lettuce</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orge1ea396" class="outline-4">
<h4 id="orge1ea396">maps and keywords</h4>
<div class="outline-text-4" id="text-orge1ea396">
<div class="org-src-container">
<pre class="src src-clojure">

</pre>
</div>
<p>
<i>assign the map values as the given keys to the matching symbol</i>
</p>
<div class="org-src-container">
<pre class="src src-clojure">(<span style="color: #00af00;">defn</span> <span style="color: #ef2929;">announce-treasure-location</span>
  [{lat <span style="color: #1f5bff;">:lat</span> lng <span style="color: #1f5bff;">:lng</span><span style="color: #999999;">}]</span>
  (print (str <span style="color: #ff1f8b;">"Treasure lat: "</span> lat<span style="color: #999999;">))</span>
  (print (str <span style="color: #ff1f8b;">"Treasure lng: "</span> lng<span style="color: #999999;">)))</span>

(announce-treasure-location {<span style="color: #1f5bff;">:lat</span> 28.22 <span style="color: #1f5bff;">:lng</span> 81.33<span style="color: #999999;">})</span>
:<span style="color: #b2b2b2; font-style: italic;">; =&gt; Treasure lat : 28.22</span>
<span style="color: #b2b2b2; font-style: italic;">;; </span><span style="color: #b2b2b2; font-style: italic;">=&gt; Treasure lng: 81.33</span>
</pre>
</div>
<p>
<i>or automatically make the assigned symbols match the keyword in the map</i>
</p>
<div class="org-src-container">
<pre class="src src-clojure">(<span style="color: #00af00;">defn</span> <span style="color: #ef2929;">announce-treasure-location</span>
  [{<span style="color: #1f5bff;">:keys</span> [lat lng<span style="color: #999999;">]}]</span>
  (print (str <span style="color: #ff1f8b;">"Treasure lat: "</span> lat<span style="color: #999999;">))</span>
  (print (str <span style="color: #ff1f8b;">"Treasure lng: "</span> lng<span style="color: #999999;">)))</span>

(announce-treasure-location {<span style="color: #1f5bff;">:lat</span> 28.22 <span style="color: #1f5bff;">:lng</span> 81.33<span style="color: #999999;">})</span>
:<span style="color: #b2b2b2; font-style: italic;">; =&gt; Treasure lat : 28.22</span>
<span style="color: #b2b2b2; font-style: italic;">;; </span><span style="color: #b2b2b2; font-style: italic;">=&gt; Treasure lng: 81.33</span>
</pre>
</div>
<p>
<i>if you still need the un-destructured input map you can use the :as keyword</i>
</p>
<div class="org-src-container">
<pre class="src src-clojure">(<span style="color: #00af00;">defn</span> <span style="color: #ef2929;">announce-treasure-location</span>
  [{<span style="color: #1f5bff;">:keys</span> [lat lng] <span style="color: #1f5bff;">:as</span> treasure-location<span style="color: #999999;">}]</span>
  (print (str <span style="color: #ff1f8b;">"Treasure lat: "</span> lat<span style="color: #999999;">))</span>
  (print (str <span style="color: #ff1f8b;">"Treasure lng: "</span> lng<span style="color: #999999;">))</span>
  (steer-ship! treasure-location)) <span style="color: #b2b2b2; font-style: italic;">;; </span><span style="color: #b2b2b2; font-style: italic;">&lt;- we still want the input/map here!</span>

(announce-treasure-location {<span style="color: #1f5bff;">:lat</span> 28.22 <span style="color: #1f5bff;">:lng</span> 81.33<span style="color: #999999;">}</span>

:<span style="color: #b2b2b2; font-style: italic;">; =&gt; Treasure lat : 28.22</span>
<span style="color: #b2b2b2; font-style: italic;">;; </span><span style="color: #b2b2b2; font-style: italic;">=&gt; Treasure lng: 81.33</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org41b41f2" class="outline-3">
<h3 id="org41b41f2">anonymous</h3>
<div class="outline-text-3" id="text-org41b41f2">
<p>
<i>create in-place functions with no name</i>
</p>
<div class="org-src-container">
<pre class="src src-clojure">(<span style="color: #00af00;">fn</span> [param-list<span style="color: #999999;">]</span>
  function body<span style="color: #999999;">)</span>
</pre>
</div>
<p>
example: feeding into the <code>(map)</code>
</p>
<div class="org-src-container">
<pre class="src src-clojure">(map (<span style="color: #00af00;">fn</span> [name] (str <span style="color: #ff1f8b;">"Hi, "</span> name))  <span style="color: #b2b2b2; font-style: italic;">;; </span><span style="color: #b2b2b2; font-style: italic;">&lt;- apply this function</span>
     [<span style="color: #ff1f8b;">"Darth Vader"</span> <span style="color: #ff1f8b;">"Mr. Magoo"</span>])   <span style="color: #b2b2b2; font-style: italic;">;; </span><span style="color: #b2b2b2; font-style: italic;">&lt;- on these inputs</span>

</pre>
</div>
<p>
<i>shorthand:</i>
</p>
<div class="org-src-container">
<pre class="src src-clojure">#(* <span style="color: #ff8700;">%</span> 3) <span style="color: #b2b2b2; font-style: italic;">;; </span><span style="color: #b2b2b2; font-style: italic;">same as (fn [x] (* x 3))</span>

(#(* <span style="color: #ff8700;">%</span> 3) 8) <span style="color: #b2b2b2; font-style: italic;">;; </span><span style="color: #b2b2b2; font-style: italic;">applied to the number 8</span>
<span style="color: #b2b2b2; font-style: italic;">;; </span><span style="color: #b2b2b2; font-style: italic;">=&gt; 24</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf4ee0a8" class="outline-3">
<h3 id="orgf4ee0a8">recusion</h3>
<div class="outline-text-3" id="text-orgf4ee0a8">
<p>
<i>needs to be stated explicitly with (recur)</i>
</p>
<div class="org-src-container">
<pre class="src src-clojure">  (<span style="color: #00af00;">defn</span> <span style="color: #ef2929;">sum</span>
    ([vals] (sum vals 0<span style="color: #999999;">))</span>
    ([vals accumulating-total<span style="color: #999999;">]</span>
     (<span style="color: #00af00;">if</span> (empty? vals<span style="color: #999999;">)</span>
       accumulating-total
       (<span style="color: #00af00;">recur</span> (rest vals) 
              (+ (first vals) accumulating-total))))) 
<span style="color: #b2b2b2; font-style: italic;">;; </span><span style="color: #b2b2b2; font-style: italic;">this calls the second overload with 2 args</span>
</pre>
</div>
</div>
</div>
</div>
